In [1]:
# Add the Pandas dependency.
import pandas as pd
import os

In [2]:
# Files to load
school_data_to_load = os.path.join("Resources","schools_complete.csv")
student_data_to_load = os.path.join("Resources","students_complete.csv")

In [3]:
# Read the school data file and store it in a Pandas DataFrame.
schools_df = pd.read_csv(school_data_to_load)
schools_count = schools_df.school_name.count()
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
# Read the student data file and store it in a Pandas DataFrame.
students_df = pd.read_csv(student_data_to_load)
students_count = students_df.student_name.count()
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
schools_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School ID    15 non-null     int64
 1   school_name  15 non-null     object
 2   type         15 non-null     object
 3   size         15 non-null     int64
 4   budget       15 non-null     int64
dtypes: int64(3), object(2)
memory usage: 728.0+ bytes

In [6]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39170 entries, 0 to 39169
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     39170 non-null  int64
 1   student_name   39170 non-null  object
 2   gender         39170 non-null  object
 3   grade          39170 non-null  object
 4   school_name    39170 non-null  object
 5   reading_score  39170 non-null  int64
 6   math_score     39170 non-null  int64
dtypes: int64(3), object(4)
memory usage: 2.1+ MB

In [7]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [8]:
for word in prefixes_suffixes:
    students_df["student_name"] = students_df["student_name"].str.replace(word,"")

In [9]:
# Check prefix and suffix
students_df[students_df['student_name'].str.contains(r'Dr. |Mr. |Ms. |Miss | MD| DDS| DVM| PhD')]

Empty DataFrame
Columns: [Student ID, student_name, gender, grade, school_name, reading_score, math_score]
Index: []

In [10]:
#Another way to remove prefix and suffix
students_df["student_name"] = students_df['student_name'].str.replace(r'Dr. |Mr. |Ms. |Mrs. |Miss | MD| DDS| DVM| PhD',"")

In [11]:
school_complete_df = students_df.merge(schools_df, on='school_name')
school_complete_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [12]:
school_complete_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39170 entries, 0 to 39169
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     39170 non-null  int64
 1   student_name   39170 non-null  object
 2   gender         39170 non-null  object
 3   grade          39170 non-null  object
 4   school_name    39170 non-null  object
 5   reading_score  39170 non-null  int64
 6   math_score     39170 non-null  int64
 7   School ID      39170 non-null  int64
 8   type           39170 non-null  object
 9   size           39170 non-null  int64
 10  budget         39170 non-null  int64
dtypes: int64(6), object(5)
memory usage: 3.6+ MB

In [13]:
school_names = school_complete_df.school_name.unique()
school_names

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [14]:
school_complete_df.budget.sum()

82932329558

In [15]:
#Get total budget by drop duplicates
total_budget = school_complete_df.drop_duplicates(subset=['school_name'])['budget'].sum()

In [16]:
#Average reading score
average_reading_score = school_complete_df['reading_score'].mean()
average_reading_score

81.87784018381414

In [17]:
# Average math score
average_math_score = school_complete_df.math_score.mean()
average_math_score

78.98537145774827

In [18]:
passing_math = school_complete_df.math_score >= 70
passing_math_df = school_complete_df[passing_math]
passing_math_count = passing_math_df['student_name'].count()
passing_math_count

29370

In [19]:
passing_reading = school_complete_df["reading_score"] >= 70
passing_reading_df = school_complete_df[passing_reading]
passing_reading_count = passing_reading_df.student_name.count()
passing_reading_count

33610

In [20]:
passing_both_df = school_complete_df.query('math_score >= 70 and reading_score >= 70')
passing_both_df
passing_both_count = passing_both_df['student_name'].count()

In [21]:

print('Total students:', students_count)

passing_math_percentage = passing_math_count / students_count *100
print(f'passing math percentage: {passing_math_percentage:.2f}')

passing_reading_percentage = passing_reading_count / students_count *100
print(f'passing reading percentage: {passing_reading_percentage:.2f}')

passing_both_percentage = passing_both_count / students_count *100
print(f'passing math and reading percentage: {passing_both_percentage:.2f}')

Total students: 39170
passing math percentage: 74.98
passing reading percentage: 85.81
passing math and reading percentage: 65.17

In [22]:
# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame(
          [{"Total Schools": schools_count,
          "Total Students": students_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,
         "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": passing_both_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [23]:
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

In [24]:
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

In [25]:
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

In [26]:
district_summary_df.iloc[0,5:] = district_summary_df.iloc[0,5:].map("{:.0f}".format)

In [27]:
district_summary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Total Schools          1 non-null      int64
 1   Total Students         1 non-null      int64
 2   Total Budget           1 non-null      object
 3   Average Math Score     1 non-null      object
 4   Average Reading Score  1 non-null      object
 5   % Passing Math         1 non-null      object
 6   % Passing Reading      1 non-null      object
 7   % Overall Passing      1 non-null      object
dtypes: int64(2), object(6)
memory usage: 192.0+ bytes

In [28]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,"$24,649,428.00",79.0,81.9,75,86,65

In [29]:
# Reorder the columns
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,"$24,649,428.00",79.0,81.9,75,86,65